### Series

In [2]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [10]:
pd.Series(data = my_data)    #Creating series from list. Index is created automatically

0    10
1    20
2    30
dtype: int64

In [14]:
pd.Series(data = my_data,index = labels)  #adding labels

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(my_data,labels)   #data and labels can be passed in order without specifying the variables

a    10
b    20
c    30
dtype: int64

In [20]:
pd.Series(d)  #Creating Series from a dictionary

a    10
b    20
c    30
dtype: int64

In [24]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [25]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [27]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [29]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [31]:
ser2['USA']

1

In [37]:
ser3 = ser1 + ser2  #adding 2 series.
ser3

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

### DataFrames

In [40]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [42]:
np.random.seed(101)

In [47]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [49]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [54]:
type(df['W'])   #Type of a column in a dataframe is Series

pandas.core.series.Series

In [56]:
type(df)    #Type of a Dataframe

pandas.core.frame.DataFrame

In [60]:
df.W    #Alternate way of fetching columns from dataframe. Not recommended. Always use Bracket notation

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [64]:
df[['W','Z']]   #Pass list of columns names to get those columns

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [69]:
df['new'] = df['W'] + df['Y']  #Adding a new columns based on a calculation from existing columns

In [70]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [74]:
df.drop('new',axis=1)   #by default

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [75]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [77]:
df.drop('new',axis=1,inplace=True)

KeyError: "['new'] not found in axis"

In [79]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [82]:
df.drop('E')

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [86]:
df.shape  #Returns the shape of a dataframe. Rows are axis=0 and columns are axis=1

(5, 4)

In [88]:
# Selecting rows from dataframe. loc and iloc

In [92]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [96]:
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [99]:
df.loc['B','Y']   #Fetching data using row,column notation

0.16690463609281317

In [106]:
df.loc[['A','B'],['Y','Z']]  #Getting subset of a dataframe.

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502

In [112]:
df.loc[:'B','Y':]  #Getting subset of a dataframe.

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502

### Conditional selection
Selecting data from dataframe based on a condition

In [113]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [117]:
booldf = df>0   #condition for dataframe

In [119]:
df[booldf]     #selecting data based on condition

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [122]:
df[df>0]  #displays NaN when df data is less than 0

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [124]:
df['W'] > 0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [128]:
df[df['W']>0]  #only returns rows when this column is True

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [134]:
resultdf = df[df['Z']<0]

In [136]:
resultdf

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [139]:
resultdf['X']

A    1.693723
Name: X, dtype: float64

In [145]:
df[df['Z']>0].loc['B','Y']

0.16690463609281317

In [208]:
# Two or more conditions
#Pythons boolean operator and, or can only take single boolean at time. It cannot take a Series of boolean. And operators will
#get confused. The truth value of a series is ambiguous. 
#Use |, & when concatinating multiple conditions in pandas dataframe

In [219]:
df[(df['W']>0) | (df['Y']<0)]  #use & or |

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [206]:
[True,False] and [True,False]

[True, False]

In [164]:
True and False

False

In [207]:
False and False

False

In [221]:
#Resetting the index

In [225]:
df.reset_index()  #creates a index of sequence numbers and add old index as a column

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [227]:
newind = 'CA NY WY OR CO'.split()

In [229]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [233]:
df['States'] = newind  #Adding a new column to dataframe

In [234]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [237]:
df.set_index('States')  #Setting an existing column as index. Note that the existing index will be dropped

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [240]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

### Multi index in a dataframe

In [242]:
import numpy as np
import pandas as pd

In [251]:
#Index Levels:
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)  #Will not be using this function at all. This takes in list of tuples and creates a multilevelindex

In [249]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [253]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [255]:
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

In [261]:
df.loc['G1'].loc[1] #Retrieving data from mulitple index

A    0.147027
B   -0.479448
Name: 1, dtype: float64

In [267]:
df.index.names = ['Groups','Num']

In [269]:
df

                   A         B
Groups Num
G1     1    0.147027 -0.479448
       2    0.558769  1.024810
       3   -0.925874  1.862864
G2     1   -1.133817  0.610478
       2    0.386030  2.084019
       3   -0.376519  0.230336

In [274]:
df.loc['G1'].loc[2,'B']

1.0248102783372157

In [286]:
df.loc['G1']

            A         B
Num
1    0.147027 -0.479448
2    0.558769  1.024810
3   -0.925874  1.862864

In [278]:
df.xs('G1')

            A         B
Num
1    0.147027 -0.479448
2    0.558769  1.024810
3   -0.925874  1.862864

In [290]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.147027 -0.479448
G2     -1.133817  0.610478

### Missing Data handling

In [292]:
import numpy as np
import pandas as pd

In [294]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [297]:
df = pd.DataFrame(d)

In [299]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [303]:
df.dropna()  #Drop rows that has aleast one missing values

     A    B  C
0  1.0  5.0  1

In [306]:
df.dropna(axis=1) #Drop columns that has alteast one missing values

   C
0  1
1  2
2  3

In [311]:
df.dropna(thresh=2)  #Keeps rows from dropping when there are atleast 2 non NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [320]:
df['A'].fillna(value=df['A'].mean())  #Filling missing values with mean of the values

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [321]:
df['A'].mean()

1.5

### Group by methods
Used with aggregate statements

In [322]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [325]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [334]:
byCompany = df.groupby('Company')

In [331]:
byCompany.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [335]:
byCompany.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [340]:
df.groupby('Company').sum().loc['FB']  #Applying Group by and aggregate function at the same statement

Sales    593
Name: FB, dtype: int64

In [343]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [348]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [104]:
df.loc[['A','B'],['Y','Z']]  #Getting subset of a dataframe.

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502
C  0.638787  0.329646
D -0.943406  0.484752
E  0.238127  1.996652

In [104]:
df.loc[['A','B'],['Y','Z']]  #Getting subset of a dataframe.

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502
C  0.638787  0.329646
D -0.943406  0.484752
E  0.238127  1.996652

### Merging, Joining and Concatenating

In [350]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [385]:
df2 = pd.DataFrame({'B': ['A4', 'A5', 'A6', 'A7'],
                        'A': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[3, 6, 7, 5])

In [355]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [384]:
df2

    B   C   D
3  B4  C4  D4
6  B5  C5  D5
7  B6  C6  D6
5  B7  C7  D7

In [387]:
pd.concat([df2,df1])

C:\Users\118472\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    A   B   C   D
3  B4  A4  C4  D4
6  B5  A5  C5  D5
7  B6  A6  C6  D6
5  B7  A7  C7  D7
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

### Pandas operations

In [388]:
import pandas as pd

In [408]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,444,666,777],'col3':['aaa','bbb','ccc','ddd']})

In [392]:
df

   col1  col2 col3
0     1   444  aaa
1     2   555  bbb
2     3   666  ccc
3     4   777  ddd

In [397]:
df.head(2)  #Returns first n rows

   col1  col2 col3
0     1   444  aaa
1     2   555  bbb

In [401]:
df['col2'].unique()  #returns all unique values in a column

array([444, 555, 666, 777], dtype=int64)

In [404]:
df['col2'].nunique()  # number of unique values

4

In [417]:
df['col2'].value_counts()

444    2
666    1
777    1
Name: col2, dtype: int64

In [422]:
df[(df['col1']>2) & (df['col2']==666)]  # Having multiple conditions in selecting a dataframe

   col1  col2 col3
2     3   666  ccc

#### Apply method

In [424]:
def times2(var):
    return var*2

In [427]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [430]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

#### Removing columns

In [433]:
df.drop('col1',axis=1)

   col2 col3
0   444  aaa
1   444  bbb
2   666  ccc
3   777  ddd

In [435]:
df

   col1  col2 col3
0     1   444  aaa
1     2   444  bbb
2     3   666  ccc
3     4   777  ddd

In [438]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [440]:
df.index

RangeIndex(start=0, stop=4, step=1)

### sorting

In [444]:
df

   col1  col2 col3
0     1   444  aaa
1     2   444  bbb
2     3   666  ccc
3     4   777  ddd

In [451]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  aaa
1     2   444  bbb
2     3   666  ccc
3     4   777  ddd

In [454]:
df.sort_values('col2',ascending=False) #sort in descending order

   col1  col2 col3
3     4   777  ddd
2     3   666  ccc
0     1   444  aaa
1     2   444  bbb

In [455]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [457]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [459]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [464]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Python Data IO

* conda install sqlalchemy
* conda install lxml
* conda install html5lib
* conda install BeautifulSoup4

In [470]:
pwd

'C:\\Users\\118472\\Python Jupyter notebooks\\Python for Data Science and Machine Learning BootCamp\\02-Python-for-Data-Analysis-NumPy'

In [479]:
%cd "00 - MyPractice"

[WinError 2] The system cannot find the file specified: '00 - MyPractice'
C:\Users\118472\Python Jupyter notebooks\Python for Data Science and Machine Learning BootCamp\00 - MyPractice

In [481]:
pwd

'C:\\Users\\118472\\Python Jupyter notebooks\\Python for Data Science and Machine Learning BootCamp\\00 - MyPractice'

In [487]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [490]:
df = pd.read_csv('example.csv')

In [495]:
df.to_csv("My_output.csv",index=False)  #Will write an index column by default. Hence apply index=False as appropriate.

In [498]:
pd.read_csv("My_output.csv")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [506]:
df2 = pd.read_excel("Excel_Sample.xlsx",sheet_name="Sheet1",index_col=0)

In [508]:
df2.to_excel("My_Excel.xlsx",sheet_name="NewSheet")

In [522]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [526]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"

In [529]:
from sqlalchemy import create_engine  #creates a sql engine in memory

In [532]:
engine = create_engine('sqlite:///:memory:')

In [536]:
df = df[0].head()

KeyError: 0

In [538]:
df

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"

In [541]:
df.to_sql("my_table1",engine)

In [543]:
sqldf = pd.read_sql('my_table1',con=engine)

In [545]:
sqldf

,index,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"